In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_list = [10,20,30]
arr = np.array(my_list)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(data=labels, index=my_list)

10    a
20    b
30    c
dtype: object

In [9]:
arr2 = np.arange(0,3)
pd.Series(arr2, labels)

a    0
b    1
c    2
dtype: int32

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [11]:
ser2 = pd.Series([1,2,5,4], index=['USA', 'Germany','Italy', 'Japan'])

In [17]:
# ser1["Germany"] = 2
# ser1["USA"] --> 1
# ser1["Japan"] ---> 4

# All nonmatching indices of Series will be NaN
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [19]:
from numpy.random import randn

In [20]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [21]:
df

          W         X         Y         Z
A  1.360758  0.488761  0.204124  1.929344
B  0.180664 -0.608973  0.297060  0.037533
C  2.002190 -0.439168 -0.677860 -1.726239
D -1.876786 -1.205041 -0.128525 -0.648845
E -0.449819  0.118695 -0.678710  0.095614

In [23]:
# Selecting a column will return a Pandas Series
# it means every column in Dataframe contains collection of pandas series
df["W"]

A    1.360758
B    0.180664
C    2.002190
D   -1.876786
E   -0.449819
Name: W, dtype: float64

In [26]:
# Pass a list of column names
df[["W", "Y"]]

          W         Y
A  1.360758  0.204124
B  0.180664  0.297060
C  2.002190 -0.677860
D -1.876786 -0.128525
E -0.449819 -0.678710

DataFrame Columns are just Series

In [27]:
df["new"] = df["Y"] + df["X"]

In [28]:
df

          W         X         Y         Z       new
A  1.360758  0.488761  0.204124  1.929344  0.692885
B  0.180664 -0.608973  0.297060  0.037533 -0.311913
C  2.002190 -0.439168 -0.677860 -1.726239 -1.117029
D -1.876786 -1.205041 -0.128525 -0.648845 -1.333566
E -0.449819  0.118695 -0.678710  0.095614 -0.560016

** Removing Columns**

In [30]:
# To delete column we have to pass axis=1 parameter
df.drop("new", axis=1)

          W         X         Y         Z
A  1.360758  0.488761  0.204124  1.929344
B  0.180664 -0.608973  0.297060  0.037533
C  2.002190 -0.439168 -0.677860 -1.726239
D -1.876786 -1.205041 -0.128525 -0.648845
E -0.449819  0.118695 -0.678710  0.095614

In [32]:
# As we have seen that droping a column had no effect on original Data Frame
# Because data frame will be updated when we put inplace = True parameter
df

          W         X         Y         Z       new
A  1.360758  0.488761  0.204124  1.929344  0.692885
B  0.180664 -0.608973  0.297060  0.037533 -0.311913
C  2.002190 -0.439168 -0.677860 -1.726239 -1.117029
D -1.876786 -1.205041 -0.128525 -0.648845 -1.333566
E -0.449819  0.118695 -0.678710  0.095614 -0.560016

In [33]:
df.drop("new", axis=1, inplace=True)

In [34]:
df

          W         X         Y         Z
A  1.360758  0.488761  0.204124  1.929344
B  0.180664 -0.608973  0.297060  0.037533
C  2.002190 -0.439168 -0.677860 -1.726239
D -1.876786 -1.205041 -0.128525 -0.648845
E -0.449819  0.118695 -0.678710  0.095614

** Selecting Rows**

In [36]:
df.loc['A']

W    1.360758
X    0.488761
Y    0.204124
Z    1.929344
Name: A, dtype: float64

In [37]:
df.loc["B"]

W    0.180664
X   -0.608973
Y    0.297060
Z    0.037533
Name: B, dtype: float64

In [39]:
# iloc means index location
# Datas from the second row 'C' was shown.
df.iloc[2]

W    2.002190
X   -0.439168
Y   -0.677860
Z   -1.726239
Name: C, dtype: float64

In [44]:
# df.loc["B", "Y"] = 0.2970603710289309
# df.loc["D","X"] = -1.2050410404588583
# df.loc["E","W"] = -0.4498188228286541
df.loc["A", "Z"]

1.9293443223368594

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [48]:
df

          W         X         Y         Z
A  1.360758  0.488761  0.204124  1.929344
B  0.180664 -0.608973  0.297060  0.037533
C  2.002190 -0.439168 -0.677860 -1.726239
D -1.876786 -1.205041 -0.128525 -0.648845
E -0.449819  0.118695 -0.678710  0.095614

In [46]:
# Datas which are satisfiying condition will be represented
df[df > 0]

          W         X         Y         Z
A  1.360758  0.488761  0.204124  1.929344
B  0.180664       NaN  0.297060  0.037533
C  2.002190       NaN       NaN       NaN
D       NaN       NaN       NaN       NaN
E       NaN  0.118695       NaN  0.095614

In [47]:
df[df["W"] > 0]

          W         X         Y         Z
A  1.360758  0.488761  0.204124  1.929344
B  0.180664 -0.608973  0.297060  0.037533
C  2.002190 -0.439168 -0.677860 -1.726239

In [50]:
df[df["W"] > 0][["Y", "Z"]]

          Y         Z
A  0.204124  1.929344
B  0.297060  0.037533
C -0.677860 -1.726239

In [51]:
df[df["X"] < 0][["W", "Y"]]

          W         Y
B  0.180664  0.297060
C  2.002190 -0.677860
D -1.876786 -0.128525

For two conditions you can use | and & with parenthesis:

In [55]:
df[(df['W'] > 0) & (df["Y"] > 0.2)]

          W         X         Y         Z
A  1.360758  0.488761  0.204124  1.929344
B  0.180664 -0.608973  0.297060  0.037533

In [56]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [57]:
df["States"] = newind

In [58]:
df

          W         X         Y         Z States
A  1.360758  0.488761  0.204124  1.929344     CA
B  0.180664 -0.608973  0.297060  0.037533     NY
C  2.002190 -0.439168 -0.677860 -1.726239     WY
D -1.876786 -1.205041 -0.128525 -0.648845     OR
E -0.449819  0.118695 -0.678710  0.095614     CO

In [59]:
df.set_index('States')

               W         X         Y         Z
States
CA      1.360758  0.488761  0.204124  1.929344
NY      0.180664 -0.608973  0.297060  0.037533
WY      2.002190 -0.439168 -0.677860 -1.726239
OR     -1.876786 -1.205041 -0.128525 -0.648845
CO     -0.449819  0.118695 -0.678710  0.095614

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [60]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [61]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [63]:
# dropna Remove missing values.
df.dropna()

     A    B  C
0  1.0  5.0  1

In [68]:
# thresh : int, optional
# Require that many non-NA values. Cannot be combined with how.
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [73]:
#Fill NA/NaN values using the specified method.
df.fillna(value="FILL VALUE")

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [76]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [83]:
df["B"].fillna(value=df["B"].sum() / df["B"].nunique())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

# Groupby

The groupby method allows you to group rows of data together and call aggregate funcons

In [84]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [85]:
df = pd.DataFrame(data)

In [86]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [89]:
df.groupby("Company").sum()

C:\Users\msi\AppData\Local\Temp\ipykernel_10632\497261261.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Company").sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [90]:
df.groupby("Company").mean()

C:\Users\msi\AppData\Local\Temp\ipykernel_10632\700525417.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Company").mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [91]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [92]:
by_comp = df.groupby("Company")

In [94]:
by_comp.std()

C:\Users\msi\AppData\Local\Temp\ipykernel_10632\3391457442.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [95]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [96]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [101]:
# Generate descriptive statistics.
# Descriptive statistics include those that summarize the central
# tendency, dispersion and shape of a
# dataset's distribution, excluding ``NaN`` values.
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [102]:
by_comp.describe().transpose()["GOOG"]

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64